In [1]:
import numpy as np
import pandas as pd

In [2]:
import matplotlib.pyplot as plt

In [3]:
import seaborn as sns

In [12]:
df = pd.read_csv('D:\Mall_Customers.csv')

In [24]:
df.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [14]:
df.loc[:,'Age'].mean()

38.85

In [17]:
ndf = df.select_dtypes(include='number')

In [18]:
ndf.mean()

CustomerID                100.50
Age                        38.85
Annual Income (k$)         60.56
Spending Score (1-100)     50.20
dtype: float64

In [19]:
ndf.mean(axis=1)[0:4]

0    18.50
1    29.75
2    11.25
3    30.00
dtype: float64

In [20]:
ndf.median()

CustomerID                100.5
Age                        36.0
Annual Income (k$)         61.5
Spending Score (1-100)     50.0
dtype: float64

In [21]:
df.loc[:,'Age'].median()

36.0

In [23]:
ndf.median(axis=1)[0:4]

0    17.0
1    18.0
2    11.0
3    19.5
dtype: float64

In [25]:
df.mode()

     CustomerID   Genre   Age  Annual Income (k$)  Spending Score (1-100)
0             1  Female  32.0                54.0                    42.0
1             2     NaN   NaN                78.0                     NaN
2             3     NaN   NaN                 NaN                     NaN
3             4     NaN   NaN                 NaN                     NaN
4             5     NaN   NaN                 NaN                     NaN
..          ...     ...   ...                 ...                     ...
195         196     NaN   NaN                 NaN                     NaN
196         197     NaN   NaN                 NaN                     NaN
197         198     NaN   NaN                 NaN                     NaN
198         199     NaN   NaN                 NaN                     NaN
199         200     NaN   NaN                 NaN                     NaN

[200 rows x 5 columns]

In [26]:
df.loc[:,'Annual Income (k$)'].mode()

0    54
1    78
Name: Annual Income (k$), dtype: int64

In [27]:
df.loc[:,'Genre'].mode()

0    Female
Name: Genre, dtype: object

In [28]:
df.min()

CustomerID                     1
Genre                     Female
Age                           18
Annual Income (k$)            15
Spending Score (1-100)         1
dtype: object

In [29]:
df.loc[:,'Age'].min(skipna = False)

18

In [30]:
df.max()

CustomerID                 200
Genre                     Male
Age                         70
Annual Income (k$)         137
Spending Score (1-100)      99
dtype: object

In [31]:
df.loc[:,'Age'].max(skipna = False)

70

In [32]:
df.loc[:,'CustomerID'].max(skipna = False)

200

In [34]:
ndf.std()

CustomerID                57.879185
Age                       13.969007
Annual Income (k$)        26.264721
Spending Score (1-100)    25.823522
dtype: float64

In [35]:
df.loc[:,'CustomerID'].std()

57.879184513951124

In [36]:
df.loc[:,'Age'].std()

13.969007331558883

In [38]:
ndf.std(axis=1)[0:4]

0    15.695010
1    35.074920
2     8.057088
3    32.300671
dtype: float64

In [39]:
df.groupby(['Genre'])['Age'].mean()

Genre
Female    38.098214
Male      39.806818
Name: Age, dtype: float64

In [41]:
df_u=df.rename(columns= {'Annual Income (k$)':'Income'},inplace=False)

In [42]:
df_u.groupby(['Genre']).Income.mean()

Genre
Female    59.250000
Male      62.227273
Name: Income, dtype: float64

In [43]:
from sklearn import preprocessing 
enc = preprocessing.OneHotEncoder() 
enc_df = pd.DataFrame(enc.fit_transform(df[['Genre']]).toarray()) 
enc_df

       0    1
0    0.0  1.0
1    0.0  1.0
2    1.0  0.0
3    1.0  0.0
4    1.0  0.0
..   ...  ...
195  1.0  0.0
196  1.0  0.0
197  0.0  1.0
198  0.0  1.0
199  0.0  1.0

[200 rows x 2 columns]

In [44]:
df_encode =df_u.join(enc_df) 
df_encode

     CustomerID   Genre  Age  Income  Spending Score (1-100)    0    1
0             1    Male   19      15                      39  0.0  1.0
1             2    Male   21      15                      81  0.0  1.0
2             3  Female   20      16                       6  1.0  0.0
3             4  Female   23      16                      77  1.0  0.0
4             5  Female   31      17                      40  1.0  0.0
..          ...     ...  ...     ...                     ...  ...  ...
195         196  Female   35     120                      79  1.0  0.0
196         197  Female   45     126                      28  1.0  0.0
197         198    Male   32     126                      74  0.0  1.0
198         199    Male   32     137                      18  0.0  1.0
199         200    Male   30     137                      83  0.0  1.0

[200 rows x 7 columns]

In [45]:
csv_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data'

In [47]:
col_names = ['Sepal_Length','Sepal_Width','Petal_Length','Petal_Width','Species']

In [48]:
iris = pd.read_csv(csv_url, names = col_names)

In [49]:
irisSet = (iris['Species']== 'Iris-setosa')

In [50]:
print('Iris-setosa')

Iris-setosa

In [51]:
print(iris[irisSet].describe())

       Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
count      50.00000    50.000000     50.000000     50.00000
mean        5.00600     3.418000      1.464000      0.24400
std         0.35249     0.381024      0.173511      0.10721
min         4.30000     2.300000      1.000000      0.10000
25%         4.80000     3.125000      1.400000      0.20000
50%         5.00000     3.400000      1.500000      0.20000
75%         5.20000     3.675000      1.575000      0.30000
max         5.80000     4.400000      1.900000      0.60000

In [52]:
irisVer = (iris['Species']== 'Iris-versicolor')

In [53]:
print('Iris-versicolor')

Iris-versicolor

In [54]:
print(iris[irisVer].describe())

       Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
count     50.000000    50.000000     50.000000    50.000000
mean       5.936000     2.770000      4.260000     1.326000
std        0.516171     0.313798      0.469911     0.197753
min        4.900000     2.000000      3.000000     1.000000
25%        5.600000     2.525000      4.000000     1.200000
50%        5.900000     2.800000      4.350000     1.300000
75%        6.300000     3.000000      4.600000     1.500000
max        7.000000     3.400000      5.100000     1.800000

In [55]:
irisVir = (iris['Species']== 'Iris-virginica')

In [56]:
print(iris[irisVir].describe())

       Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
count      50.00000    50.000000     50.000000     50.00000
mean        6.58800     2.974000      5.552000      2.02600
std         0.63588     0.322497      0.551895      0.27465
min         4.90000     2.200000      4.500000      1.40000
25%         6.22500     2.800000      5.100000      1.80000
50%         6.50000     3.000000      5.550000      2.00000
75%         6.90000     3.175000      5.875000      2.30000
max         7.90000     3.800000      6.900000      2.50000